<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"d711ecf86c6852ee34ad538cd70e2e82d7031b366a0a095f4551f587c4d4d99f","plan_job_ref":"Job Test actions using target, replace, and exclude #17 at https://github.com/dflook/terraform-github-actions/actions/runs/16695493720","plan_out_hash":"619b89fea3c7a654dd3b807cb3f59fd28be0b0303f63f9ead0500ca2f35c4ffd","plan_hash":"c0ebe211c15b615fd4eea6ff28aa20a51d6c51cb676467c2a64d6cc43cfcde56","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 5 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.also_exclude will be created
+   resource "random_string" "also_exclude" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.exclude_me will be created
+   resource "random_string" "exclude_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.keep_me will be created
+   resource "random_string" "keep_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
+   also_exclude = (known after apply)
!~  count        = "7181Ir08zX" -> (known after apply)
+   exclude_me   = (known after apply)
!~  foreach      = "EMAcBikmeF" -> (known after apply)
+   keep_me      = (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target, replace, and exclude #17](https://github.com/dflook/terraform-github-actions/actions/runs/16695493720)